#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with module.cdn.aws_s3_bucket.origin,
  on .terraform/modules/cdn/main.tf line 257, in resource "aws_s3_bucket" "origin":
 257:   acl           = "private"

Use the aws_s3_bucket_acl resource instead
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cdn.random_password.referer[0]: Refreshing state... [id=none]
module.cdn.aws_cloudfront_origin_access_identity.default[0]: Refreshing state... [id=E3OEDWFE328RRQ]
module.cdn.module.logs.data.aws_partition.current[0]: Reading...
data.aws_acm_certificate.this: Reading...
module.cdn.data.aws_partition.current[0]: Reading...
module.cdn.module.logs.data.aws_caller_identity.current[0]: Reading...
module.cdn.module.logs.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.cdn.data.aws_region.current[0]: Reading...
data.aws_route53_zone.this: Reading...
data.aws_s3_bucket.this: Reading...
module.cdn.module.logs.module.aws_s3_bucket.data.aws_canonical_user_id.default[0]: Reading...
module.cdn.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.cdn.module.logs.module.aws_s3_bucket.aws_s3_bucket.default[0]: Refreshing state... [id=kq4afy-use1-cdn-logs]
module.cdn.module.logs.module.aws_s3_bucket.data.aws_partition.current[0]: Reading...
module.cdn.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.cdn.module.logs.module.aws_s3_bucket.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.cdn.module.logs.data.aws_caller_identity.current[0]: Read complete after 0s [id=072105303426]
data.aws_s3_bucket.this: Read complete after 0s [id=kq4afy.xyz]
module.cdn.data.aws_s3_bucket.origin[0]: Reading...
module.cdn.module.logs.module.aws_s3_bucket.data.aws_canonical_user_id.default[0]: Read complete after 0s [id=0415ac49d2dbae53693985f648ef7b9ed41476f5aca8c9cafc28423e8d578bd3]
module.cdn.data.aws_s3_bucket.origin[0]: Read complete after 0s [id=kq4afy.xyz]
module.cdn.module.logs.module.aws_s3_bucket.aws_s3_bucket_public_access_block.default[0]: Refreshing state... [id=kq4afy-use1-cdn-logs]
module.cdn.module.logs.module.aws_s3_bucket.data.aws_iam_policy_document.bucket_policy[0]: Reading...
module.cdn.module.logs.module.aws_s3_bucket.data.aws_iam_policy_document.bucket_policy[0]: Read complete after 0s [id=12357417]
module.cdn.module.logs.module.aws_s3_bucket.data.aws_iam_policy_document.aggregated_policy[0]: Reading...
module.cdn.module.logs.module.aws_s3_bucket.data.aws_iam_policy_document.aggregated_policy[0]: Read complete after 0s [id=1295613764]
module.cdn.module.logs.module.aws_s3_bucket.aws_s3_bucket_policy.default[0]: Refreshing state... [id=kq4afy-use1-cdn-logs]
module.cdn.module.logs.module.aws_s3_bucket.time_sleep.wait_for_aws_s3_bucket_settings[0]: Refreshing state... [id=2022-12-08T19:04:45Z]
module.cdn.module.logs.module.aws_s3_bucket.aws_s3_bucket_ownership_controls.default[0]: Refreshing state... [id=kq4afy-use1-cdn-logs]
data.aws_acm_certificate.this: Read complete after 0s [id=arn:aws:acm:us-east-1:072105303426:certificate/b89f103c-57a2-4aa5-bd9c-bfed2eb09df0]
data.aws_route53_zone.this: Read complete after 0s [id=Z048504419NDW43VP1NZI]
module.cdn.module.dns.data.aws_route53_zone.default[0]: Reading...
module.cdn.data.aws_iam_policy_document.s3_website_origin[0]: Reading...
module.cdn.data.aws_iam_policy_document.s3_website_origin[0]: Read complete after 0s [id=2431280419]
module.cdn.data.aws_iam_policy_document.combined[0]: Reading...
module.cdn.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=51654406]
module.cdn.aws_s3_bucket_policy.default[0]: Refreshing state... [id=kq4afy.xyz]
module.cdn.aws_cloudfront_distribution.default[0]: Refreshing state... [id=E24XCU50JVWOD5]
module.cdn.module.dns.data.aws_route53_zone.default[0]: Read complete after 1s [id=Z048504419NDW43VP1NZI]
module.cdn.module.dns.aws_route53_record.ipv6["kq4afy.xyz"]: Refreshing state... [id=Z048504419NDW43VP1NZI_kq4afy.xyz_AAAA]
module.cdn.module.dns.aws_route53_record.default["kq4afy.xyz"]: Refreshing state... [id=Z048504419NDW43VP1NZI_kq4afy.xyz_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cdn.aws_s3_bucket_public_access_block.origin[0] will be created
  + resource "aws_s3_bucket_public_access_block" "origin" {
      + block_public_acls       = true
      + block_public_policy     = false
      + bucket                  = "kq4afy.xyz"
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = false
    }

  # module.cdn.module.logs.aws_s3_bucket.default[0] has moved to module.cdn.module.logs.module.aws_s3_bucket.aws_s3_bucket.default[0]
    resource "aws_s3_bucket" "default" {
        id                          = "kq4afy-use1-cdn-logs"
        tags                        = {
            "Attributes" = "logs"
            "Name"       = "kq4afy-use1-cdn-logs"
            "Namespace"  = "kq4afy"
            "Stage"      = "use1"
        }
        # (12 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.cdn.module.logs.module.aws_s3_bucket.aws_s3_bucket_acl.default[0] will be created
  + resource "aws_s3_bucket_acl" "default" {
      + bucket = "kq4afy-use1-cdn-logs"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = "FULL_CONTROL"

              + grantee {
                  + display_name = (known after apply)
                  + id           = "c4c1ede66af53448b93c283ce9448c4ba468c9432aa01d700d3878632f77d2d0"
                  + type         = "CanonicalUser"
                }
            }
          + owner {
              + display_name = (known after apply)
              + id           = "0415ac49d2dbae53693985f648ef7b9ed41476f5aca8c9cafc28423e8d578bd3"
            }
        }
    }

  # module.cdn.module.logs.module.aws_s3_bucket.aws_s3_bucket_lifecycle_configuration.default[0] will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "default" {
      + bucket = "kq4afy-use1-cdn-logs"
      + id     = (known after apply)

      + rule {
          + id     = "kq4afy-use1-cdn-logs"
          + status = "Enabled"

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 5
            }

          + expiration {
              + days                         = 90
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }

          + noncurrent_version_transition {
              + noncurrent_days = 30
              + storage_class   = "GLACIER"
            }

          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 60
              + storage_class = "GLACIER"
            }
        }
    }

  # module.cdn.module.logs.aws_s3_bucket_ownership_controls.default[0] has moved to module.cdn.module.logs.module.aws_s3_bucket.aws_s3_bucket_ownership_controls.default[0]
    resource "aws_s3_bucket_ownership_controls" "default" {
        id     = "kq4afy-use1-cdn-logs"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.cdn.module.logs.aws_s3_bucket_policy.default[0] has moved to module.cdn.module.logs.module.aws_s3_bucket.aws_s3_bucket_policy.default[0]
    resource "aws_s3_bucket_policy" "default" {
        id     = "kq4afy-use1-cdn-logs"
        # (2 unchanged attributes hidden)
    }

  # module.cdn.module.logs.aws_s3_bucket_public_access_block.default[0] has moved to module.cdn.module.logs.module.aws_s3_bucket.aws_s3_bucket_public_access_block.default[0]
    resource "aws_s3_bucket_public_access_block" "default" {
        id                      = "kq4afy-use1-cdn-logs"
        # (5 unchanged attributes hidden)
    }

  # module.cdn.module.logs.module.aws_s3_bucket.aws_s3_bucket_server_side_encryption_configuration.default[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
      + bucket = "kq4afy-use1-cdn-logs"
      + id     = (known after apply)

      + rule {
          + bucket_key_enabled = false

          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.cdn.module.logs.module.aws_s3_bucket.aws_s3_bucket_versioning.default[0] will be created
  + resource "aws_s3_bucket_versioning" "default" {
      + bucket = "kq4afy-use1-cdn-logs"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Suspended"
        }
    }

  # module.cdn.module.logs.time_sleep.wait_for_aws_s3_bucket_settings[0] has moved to module.cdn.module.logs.module.aws_s3_bucket.time_sleep.wait_for_aws_s3_bucket_settings[0]
    resource "time_sleep" "wait_for_aws_s3_bucket_settings" {
        id               = "2022-12-08T19:04:45Z"
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cdn.aws_s3_bucket.origin,
  on .terraform/modules/cdn/main.tf line 257, in resource "aws_s3_bucket" "origin":
 257:   acl           = "private"

Use the aws_s3_bucket_acl resource instead

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*